###################################################################

# Created by write_sdc on Thu Jul  2 11:48:36 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports clk_i]  -name clk  -period 5  -waveform {0 2.5}
set_input_delay -clock clk  -max 2  [get_ports rst_n_i]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[31]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[30]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[29]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[28]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[27]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[26]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[25]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[24]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[23]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[22]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[21]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[20]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[19]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[18]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[17]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[16]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[15]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[14]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[13]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[12]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[11]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[10]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[9]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[8]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[7]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[6]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[5]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[4]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[3]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[2]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[1]}]
set_input_delay -clock clk  -max 2  [get_ports {if_instr_i[0]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[31]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[30]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[29]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[28]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[27]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[26]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[25]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[24]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[23]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[22]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[21]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[20]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[19]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[18]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[17]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[16]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[15]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[14]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[13]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[12]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[11]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[10]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[9]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[8]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[7]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[6]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[5]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[4]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[3]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[2]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[1]}]
set_input_delay -clock clk  -max 2  [get_ports {bus_rdata_i[0]}]
set_input_delay -clock clk  -max 2  [get_ports bus_ready_i]
set_input_delay -clock clk  -max 2  [get_ports intr_timer_i]
set_input_delay -clock clk  -max 2  [get_ports intr_software_i]
set_input_delay -clock clk  -max 2  [get_ports intr_external_i]
set_input_delay -clock clk  -max 2  [get_ports intr_spi_i]
set_input_delay -clock clk  -max 2  [get_ports intr_i2c_i]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[31]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[30]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[29]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[28]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[27]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[26]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[25]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[24]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[23]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[22]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[21]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[20]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[19]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[18]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[17]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[16]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[15]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[14]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[13]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[12]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[11]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[10]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[9]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[8]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[7]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[6]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[5]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[4]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[3]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[2]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[1]}]
set_output_delay -clock clk  -max 2  [get_ports {if_pc_o[0]}]
set_output_delay -clock clk  -max 2  [get_ports bus_re_o]
set_output_delay -clock clk  -max 2  [get_ports bus_we_o]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[31]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[30]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[29]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[28]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[27]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[26]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[25]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[24]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[23]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[22]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[21]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[20]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[19]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[18]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[17]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[16]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[15]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[14]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[13]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[12]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[11]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[10]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[9]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[8]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[7]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[6]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[5]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[4]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[3]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[2]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[1]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_addr_o[0]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[31]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[30]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[29]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[28]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[27]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[26]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[25]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[24]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[23]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[22]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[21]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[20]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[19]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[18]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[17]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[16]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[15]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[14]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[13]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[12]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[11]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[10]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[9]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[8]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[7]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[6]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[5]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[4]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[3]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[2]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[1]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_wdata_o[0]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_width_o[2]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_width_o[1]}]
set_output_delay -clock clk  -max 2  [get_ports {bus_width_o[0]}]
