###################################################################

# Created by write_sdc on Thu Jul  2 16:22:07 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports clk_i]  -name clk  -period 5  -waveform {0 2.5}
set_input_delay -clock clk  -max 2  [get_ports rst_n_i]
set_input_delay -clock clk  -max 2  [get_ports uart_rx_i]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[31]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[30]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[29]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[28]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[27]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[26]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[25]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[24]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[23]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[22]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[21]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[20]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[19]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[18]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[17]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[16]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[15]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[14]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[13]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[12]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[11]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[10]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[9]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[8]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[7]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[6]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[5]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[4]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[3]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[2]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[1]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_io[0]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[31]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[30]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[29]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[28]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[27]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[26]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[25]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[24]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[23]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[22]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[21]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[20]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[19]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[18]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[17]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[16]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[15]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[14]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[13]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[12]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[11]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[10]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[9]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[8]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[7]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[6]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[5]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[4]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[3]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[2]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[1]}]
set_input_delay -clock clk  -max 2  [get_ports {gpio_in[0]}]
set_input_delay -clock clk  -max 2  [get_ports spi_miso_i]
set_input_delay -clock clk  -max 2  [get_ports i2c_sda_io]
set_input_delay -clock clk  -max 2  [get_ports i2c_scl_io]
set_input_delay -clock clk  -max 2  [get_ports intr_software_i]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[31]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[30]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[29]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[28]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[27]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[26]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[25]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[24]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[23]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[22]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[21]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[20]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[19]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[18]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[17]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[16]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[15]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[14]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[13]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[12]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[11]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[10]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[9]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[8]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[7]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[6]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[5]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[4]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[3]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[2]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[1]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_io[0]}]
set_output_delay -clock clk  -max 2  [get_ports i2c_sda_io]
set_output_delay -clock clk  -max 2  [get_ports i2c_scl_io]
set_output_delay -clock clk  -max 2  [get_ports uart_tx_o]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[31]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[30]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[29]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[28]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[27]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[26]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[25]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[24]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[23]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[22]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[21]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[20]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[19]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[18]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[17]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[16]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[15]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[14]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[13]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[12]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[11]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[10]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[9]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[8]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[7]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[6]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[5]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[4]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[3]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[2]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[1]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_out[0]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[31]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[30]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[29]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[28]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[27]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[26]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[25]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[24]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[23]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[22]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[21]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[20]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[19]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[18]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[17]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[16]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[15]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[14]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[13]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[12]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[11]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[10]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[9]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[8]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[7]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[6]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[5]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[4]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[3]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[2]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[1]}]
set_output_delay -clock clk  -max 2  [get_ports {gpio_oe[0]}]
set_output_delay -clock clk  -max 2  [get_ports spi_sclk_o]
set_output_delay -clock clk  -max 2  [get_ports spi_mosi_o]
set_output_delay -clock clk  -max 2  [get_ports spi_cs_o]
